#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词:
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手(1)。


int main()
{
	int x[4] = {0};
	int i = 0;
	for (i = 0; i < 4; i++)
	{
		x[i] = 1;
		if ((x[0] != 1) +//A说不是他所以 A(x[0]) != 1 
			(x[2] == 1) +//B说是C 所以   C(x[2]）== 1
			(x[3] == 1) +//C说是D 所以   D(x[3]) == 1
			(x[3] != 1) == 3)//D说不是他 D(x[3]) != 1
			//判断条件为真返回1，三人说实话一人说谎话正确返回值应该为3
		{
			break;
		}
		else
			x[i] = 0;
	}
	printf("凶手就是%c", 'A' + i);
	return 0;
}
