#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>




////算术操作符
//int main()
//{
//	//除号操作符-/两端都是整数，操作的是整数除法
//	//有一段是浮点数时，就执行浮点数除法
//	printf("%d\n", 7 / 2);
//	printf("%f\n", 7 / 2.0);%.2f(小数点后两位)
//	printf("%d\n", 7 / 0);//err
//
//	printf("%d\n", 7 % 2);//  %-得余数(必须整数)
//
//	return 0;
//}


//移位操作符
//<<左移  >>右移
//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	//移动的是二进制位
//	//整数的二进制三种表示形式：原码，反码，补码（仅整数）；
//	//正整数原，反，补相同；
//	//负整数原，反，补需计算；
//	//5   ---   101
//	printf("%d", b);
//	return 0;
//}

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001 - 原码
//	//按位取反
//	//11111111111111111111111111111110 - 反码
//	//反码+1得到补码
//	//11111111111111111111111111111111 - 补码 - - 计算机内储存
//	int b = a << 1;
//	//11111111111111111111111111111110 - 补码
//	//11111111111111111111111111111101 - 反码
//	//10000000000000000000000000000010 - 原码
//	// -2
//	printf("%d", b);
//	return 0;
//}

//右移操作符
int main()
{
	int a = -1;
	int b = a >> 1;
	//算术右移：（当前编译器采用）
		//右边丢弃，左边补原来的符号位
	//逻辑右移：
		//右边丢弃，左边补0
	printf("%d", b);
	return 0;

}






